---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ViewScheduleExportOptions Constructor
ViewScheduleExportOptions Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | ViewScheduleExportOptions()()()() | Constructs a new instance of the ViewScheduleExportOptions class |
|  | ViewScheduleExportOptions(ViewScheduleExportOptions) | Constructs a new copy of the input ViewScheduleExportOptions object. |

# See Also

ViewScheduleExportOptions Class

ViewScheduleExportOptions Members

Autodesk.Revit.DB Namespace